In [6]:
import pandas as pd
import numpy as np
data = {'team' : ['1', '3', '2', '5'],
        'against': ['saudiarabia', 'russia', 'uruguay', 'egypt'],
        'fifa_rank': [65, 63, 31, 21]}
columns = ['team', 'against', 'fifa_rank']
df = pd.DataFrame(data, columns = columns)
df

  team      against  fifa_rank
0    1  saudiarabia         65
1    3       russia         63
2    2      uruguay         31
3    5        egypt         21

In [11]:
df["team"]

0    1
1    3
2    2
3    5
Name: team, dtype: object

In [10]:
df.aganist.replace(int(df["team"]) + df['fifa_rank'], axis=1, inplace=True)

AttributeError: 'DataFrame' object has no attribute 'aganist'

In [8]:
d1 = [[1,2],[3,4]]
df = pd.DataFrame(d1, columns=["one", "two"])
print(df[df.one == 1].replace({(1:2)}, axis=1, inplace=True))
df

SyntaxError: invalid syntax (<ipython-input-8-668efc35cfa5>, line 3)

In [9]:
df1 = np.array([[1, np.nan, 3, 0],[np.nan,1,3,0], [1,1,np.nan,0]])
df1 = pd.DataFrame(data=df1, columns=["A","B","C","D"])
df1

     A    B    C    D
0  1.0  NaN  3.0  0.0
1  NaN  1.0  3.0  0.0
2  1.0  1.0  NaN  0.0

In [16]:
df1[df1['A'] == 1.0].replace({'B':np.nan}, {'B':0}, inplace=True)
df1

     A    B    C    D
0  1.0  NaN  3.0  0.0
1  NaN  1.0  3.0  0.0
2  1.0  1.0  NaN  0.0

In [69]:
for i in ['A','D']:
    df1.replace({i:0},{i:"new"}, inplace=True)
df1

     A  B  C    D
0    1  0  3  new
1  new  1  3  new

In [68]:
df1.replace({"A":{1:"new", 0:"b"}})

     A  B  C  D
0  new  0  3  0
1    b  1  3  0

In [13]:
df = pd.DataFrame({'A': ['bat', 'foo', 'bait'], 'B': ['abc', 'bar', 'xyz']})

In [16]:
df.replace({'A': r'^ba.$'}, {'A': 'new'}, regex=True)

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [23]:
df.replace(regex=['bat', 'foo'], value='new')

      A    B
0   new  abc
1   new  bar
2  bait  xyz

In [74]:
series = pd.Series(data=[1,np.nan,3], index=["one", "two", "three"])
series

one      1.0
two      NaN
three    3.0
dtype: float64

In [88]:
series.isna().two

True

In [17]:
a = [1,2,3,4,5,1,2,3,4,5]
x = lambda x : x + 1 if x > 3
b = map(x, a)
b

SyntaxError: invalid syntax (<ipython-input-17-cf92bf76b7f4>, line 2)

In [ ]:
list_columns = ['a', 'b' , 'c', 'd', 'e']
df =